# Pandas - DataFrames

Workhorse of pandas, like number of series objects merged together using same index

In [7]:
import pandas as pd
import numpy as np

In [8]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [10]:
#create data frame
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752

In [45]:
#create df exp.2
df2 = pd.DataFrame([['mouse','cat'],['monkey','bird']],[1,2],['a','b'])

In [46]:
df2

        a     b
1   mouse   cat
2  monkey  bird

In [14]:
#how to grab the columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
#create new column
#define as if it already exists
df['new'] = df['W'] + df['Z']

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [48]:
#create new column exp.2
df2['c'] = ['horse','snake']

In [49]:
df2

        a     b      c
1   mouse   cat  horse
2  monkey  bird  snake

In [17]:
#delete row (index) permanently
df.drop('E',inplace=True)

In [18]:
#delete column temporarily
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [28]:
df2

        a     b
1   mouse   cat
2  monkey  bird